[
  {
    "term": "Process",
    "headline": "A process is a smart contract deployed on AO",
    "definition": "Processes hold state, receive messages, and have functions to handle different interactions."
  },
  {
    "term": "Permaweb",
    "headline": "The Permaweb is a decentralized and immutable web built on top of Arweave",
    "definition": "The Permaweb refers to web applications and dApps built on AO and Arweave, accessible just like the normal web - but immutable and long-lasting.",
    "link": "https://arweave.net/0eRcI5PpUQGIDcBGTPCcANkUkgY85a1VGf0o7Y-q01o/#/en/the-permaweb"
  },
  {
    "term": "Message",
    "headline": "Messages are how processes on AO communicate",
    "definition": "Every interaction with a process on AO is sent as a message - each one verifiable, and stored as a transaction on Arweave."
  },
  {
    "term": "Handlers",
    "headline": "AO uses handlers to respond to different types of interactions (messages)",
    "definition": "Processes on AO contain handlers, which are functions written to \"handle\" different types of interactions."
  },
  {
    "term": "Arweave Wallet",
    "headline": "AO processes are deployed using an Arweave wallet",
    "definition": "An Arweave wallet is a crypto wallet which stores and holds $AR tokens. A wallet can be used to deploy AO processes, and upload data to Arweave."
  },
  {
    "term": "AOS",
    "headline": "AOS is a system used to interact with AO",
    "definition": "Developers can use AOS to deploy, execute, and interact with processes on AO. It includes common Lua modules to get started building processes.",
    "link": "https://cookbook_ao.arweave.net/guides/aos/intro.html"
  },
  {
    "term": "Arweave",
    "headline": "Arweave is the storage layer powering AO",
    "definition": "Every single AO process and message is stored and read from Arweave. It acts as the state layer for each process, while AO nodes read from it and perform computation.",
    "link": "https://www.arweave.org/"
  },
  {
    "term": "ArDrive",
    "headline": "Permanent cloud storage platform",
    "definition": "ArDrive is like your favourite cloud storage app, but pay once, store permanently. Users can upload files, pages, and more.",
    "link": "https://ardrive.io/"
  },
  {
    "term": "AOLink",
    "headline": "Explorer for AO processes",
    "definition": "AOLink is popular explorer for viewing AO processes, messages, and statistics.",
    "link": "https://ao.link"
  },
  {
    "term": "AOX",
    "headline": "AOX is a cross-chain bridge for AO and Arweave",
    "definition": "Users can bring wrapped assets in and out of the AO ecosystem, and can bridge assets from both Arweave and Ethereum.",
    "link": "https://aox.xyz"
  },
  {
    "term": "Apus Network",
    "headline": "GPU network providing computing power to AO",
    "definition": "Apus Network is a GPU network providing GPU computing power to AO, largely focused on decentralized AI applications.",
    "link": "https://apus.network"
  },
  {
    "term": "Astro",
    "headline": "AstroUSD ($USDA) is AO's first native stablecoin",
    "definition": "Astro aims to solve liquidity fragementation by acting a a universal conversion layer for different kinds of stablecoins bridged to AO.",
    "link": "https://astrousd.com"
  },
  {
    "term": "Basejump",
    "headline": "A platform for users to create their own games",
    "definition": "Basejump is a platform for users to create and play their own games with transferable assets. Basejump's ACTION substrate is built on top of AO, and data/metadata is settled on Arweave.",
    "link": "https://basejump.xyz"
  },
  {
    "term": "Bazar",
    "headline": "Atomic Asset (NFT) marketplace built on AO",
    "definition": "Bazar is an Atomic Asset (NFT) marketplace and launchpad built on AO, with assets and their associated metadata stored on Arweave.",
    "link": "https://bazar.arweave.net"
  },
  {
    "term": "Beacon Wallet",
    "headline": "Beacon is a native iOS mobile wallet for AO and Arweave",
    "definition": "Beacon is a non-custodial Arweave and AO native wallet that includes features such as 2FA, multi-sigs, built-in app integrations, and social recovery.",
    "link": "https://beaconwallet.app"
  },
  {
    "term": "BetterIDEa",
    "headline": "A web-based IDE for developing applications on AO",
    "definition": "BetterIDEa is a web-based IDE for developing applications on AO. It has built-in support for the AO Package Manager (APM) and other features for developing processes on AO.",
    "link": "https://betteridea.dev"
  },
  {
    "term": "Botega",
    "headline": "Botega is a decentralized exchange (DEX) and DeFi platform built on AO",
    "definition": "It is fully decentralized with the frontend stored on Arweave and backend processes on AO, and is focused on supporting sophisticated strategies and autonomous trading agents.",
    "link": "https://botega.arweave.net"
  },
  {
    "term": "Dexi",
    "headline": "Dexi is financial data platform for AO",
    "definition": "Dexi aggregates data from liquidity pools agents deployed on AO, and siplays data on trading volume, asset prices, fluctuations, and more.",
    "link": "https://dexi.arweave.net"
  },
  {
    "term": "LiquidOps",
    "headline": "LiquidOps is a lending and borrowing platform built on AO",
    "definition": "Users can accrue interest by providing liquidty, and lenders can take overcollateralized loans from the protocol.",
    "link": "https://liquidops.io"
  },
  {
    "term": "Load Network",
    "headline": "Load is an \"onchain data center\" focused on scaling EVM storage",
    "definition": "Load Network is focused on scaling EVM storage via Arweave, and building out other developer solutions and infrastructure for uploading data to the Permaweb.",
    "link": "https://www.load.network/"
  },
  {
    "term": "Lua",
    "headline": "Lua is the programming language used for AO processes",
    "definition": "Lua is a dynamically-typed, lightweight programming language used to write processes on AO.",
    "link": "https://learnxinyminutes.com/lua/"
  },
  {
    "term": "Permaswap",
    "headline": "Permaswap is a decentralized exchange (DEX) in the AO ecosystem",
    "definition": "Users can swap between assets such as AO, wrapped AR, and more, and can place limit orders and set up a custom slippage amount.",
    "link": "https://permaswap.network"
  },
  {
    "term": "PerplexFi",
    "headline": "A perpetual trading platform built on AO",
    "definition": "Perplex is a perpetual futures trading platform built fully onchain, on AO. Users can trade perpetual contracts with leverage, provide liquidty and earn yield from pools, and more.",
    "link": "https://perplex.finance"
  },
  {
    "term": "ProtocolLand",
    "headline": "Onchain hosting platform for code repositories",
    "definition": "ProtocolLand is like GitHub, but built on Arweave and AO. Users can store their code repositories and deploy websites and apps through built-in integrations.",
    "link": "https://protocol.land"
  },
  {
    "term": "RandAO",
    "headline": "Verifiable Random Function (VRF) protocol on AO",
    "definition": "RandAO is a Verifiable Random Function (VRF) protocol providing decentralized, provable randomness to the AO ecosystem.",
    "link": "https://www.randao.net/"
  },
  {
    "term": "StarGrid Battle Tactics",
    "headline": "A popular turn-based tactics game",
    "definition": "StarGrid is a turn-based tactics game built fully onchain, on AO. StarGrid is free to play, and supports logins through Wander and Metamask.",
    "link": "https://stargrid.arweave.net"
  },
  {
    "term": "Vento",
    "headline": "DEX aggregator for AO",
    "definition": "Vento is a DEX aggregator for AO. Vento was created by Vela Ventures, and aims to provide users with efficient routing for swaps on AO.",
    "link": "https://ventoswap.com"
  },
  {
    "term": "ViewBlock",
    "headline": "A popular block explorer for Arweave",
    "definition": "Viewblock is one of the most popular block explorers for Arweave, and provides information on transactions, nodes, Arweave's storage endowment, and more.",
    "link": "https://viewblock.io"
  },
  {
    "term": "Wander Wallet",
    "headline": "Browser extension and mobile wallet for Arweave and AO",
    "definition": "Wander (formerly ArConnect) is a non-custodial Arweave and AO native wallet with extensive features. It's available as a browser extension and mobile app.",
    "link": "https://wander.app/"
  },
  {
    "term": "Autonomous Finance",
    "headline": "A DeFi organization focused on agentic finance on AO",
    "definition": "Autonomous Finance is an organization building out DeFi products and infrastructure on AO. Their products include Botega and Dexi.",
    "link": "https://autonomous.finance"
  },
  {
    "term": "Arweave Explorer",
    "headline": "An ArNS data explorer",
    "definition": "explorer.arweave.net is not an Arweave block explorer, but rather an ArNS-powered data explorer for Arweave, built on AR.IO and Wayfinder.",
    "link": "https://explorer.arweave.net"
  },
  {
	  "term": "Permaweb Index",
	  "headline": "The Permaweb Index ($PI) is a unifying token for the Permaweb",
	  "definition": "The Permaweb Index ($PI) is a token which represents 1/3 Arweave (AR), 1/3 AO, and 1/3 projects building on the Permaweb. \nIt acts as a single token to gain exposure to the entire Permaweb ecosystem, and users can allocate their yield to specified Permaweb projects. \nNot financial advice.",
	  "link": "https://ao.arweave.net/#/delegate"
  },
  {
    "term": "ArFleet",
    "headline": "ArFleet is a temporary storage platform on AO",
    "definition": "ArFleet is a temporary or time-based storage platform built on AO. ArFleet is currently in testnet, and can be accessed with an ArFleet Genesis Pass.",
    "link": "https://arfleet.arweave.net"
  },
  {
    "term": "Permanent Storage",
    "headline": "Arweave provides decentralized, tamper-proof data storage where files are stored permanently onchain.",
    "definition": "This is made possible through an endowment model, where a single upfront fee covers storage costs for at least 200 years, with no need for renewals or ongoing payments."
  },
  {
    "term": "Blockweave",
    "headline": "The Blockweave is Arweave’s unique way of storing data, operating more like a web than a chain.",
    "definition": "It checks random pieces instead of everything in order, saving energy and letting it store huge amounts of info safely and efficiently."
  },
  {
    "term": "ArNS",
    "headline": "ArNS is shorthand for the Arweave Name Service.",
    "definition": "ArNS domains connect friendly names to permanent applications, pages, data, or identities.",
    "link": "https://ar.io/arns"
  },
  {
    "term": "Actor Oriented",
    "headline": "AO processes follow the actor model of computation.",
    "definition": "Actor oriented means each process works independently with its own data and talks to other processes by sending messages. This setup makes building reliable and flexible decentralized apps easier."
  },
  {
    "term": "Arweave Name System",
    "headline": "The Arweave Name System (ArNS) connects friendly names to permanent applications, pages, data, or identities.",
    "definition": "Unlike traditional domains, ArNS names never expire and don’t rely on a central authority.",
    "link": "https://ar.io/arns"
  },
  {
    "term": "Bridge",
    "headline": "A bridge is a system that enables the transfer of assets from one blockchain ecosystem to another.",
    "definition": "In the case of AO Computer, users may wish to bridge Arweave's native coin $AR to AO, or perform other cross-chain transfers with assets such as stETH, DAI, or USDS from Ethereum."
  },
  {
    "term": "Bundler",
    "headline": "A service for aggregating data uploads",
    "definition": "A bundler batches multiple uploads into a single Arweave transaction to improve efficiency. Bundling relies upon the ANS-104 standard.",
  },
  {
    "term": "Arweave Network Standard",
    "headline": "Agreed-upon rules for building on Arweave",
    "definition": "Arweave Network Standards (ANS) define common formats, protocols, and conventions for storing and interacting with data on Arweave. Each standard is numbered, like ANS-###, and helps ensure compatibility across apps and tools.",
    "link": "https://github.com/ArweaveTeam/arweave-standards/tree/master/ans"
  },
  {
    "term": "ANS-104",
    "headline": "Standard for bundling multiple data items into one transaction",
    "definition": "ANS-104 defines how to combine multiple independently signed data items into a single Arweave transaction—making uploads more efficient and scalable.",
    "link": "https://github.com/ArweaveTeam/arweave-standards/blob/master/ans/ANS-104.md"
  },
  {
    "term": "Arweave Name Token",
    "headline": "A token that controls an ArNS name on AO",
    "definition": "Each Arweave Name Token (ANT) is linked to a registered ArNS name and lets the owner manage subdomains, update associated Arweave transaction IDs, transfer ownership, and perform other name-related functions.",
    "link": "https://arns.ar.io/"
  },
  {
    "term": "ANT",
    "headline": "A token that controls an ArNS name on AO",
    "definition": "Each ANT (short for Arweave Name Token) is linked to a registered ArNS name and lets the owner manage subdomains, update associated Arweave transaction IDs, transfer ownership, and perform other name-related functions.",
    "link": "https://arns.ar.io/"
  },
  {
    "term": "Weave",
    "headline": "The collective data stored on the Arweave network",
    "definition": "Weave refers to all the data permanently stored across Arweave's decentralized network, forming a single, immutable archive.",
    "link": "https://viewblock.io/arweave/stat/cumulativeWeaveSize"
  },
  {
    "term": "Gateway",
    "headline": "Gateways connect users to the Arweave network",
    "definition": "Gateways facilitate data hosting, domain management, and seamless querying on Arweave. Running a gateway helps secure the network and can earn rewards. Not financial advice.",
    "link": "https://ar.io/gateways"
  },
  {
    "term": "Universal Data License (UDL)",
    "headline": "An onchain content license format",
    "definition": "The Universal Data License (UDL) lets creators define how their permaweb files can be used or shared, right onchain.",
    "link": "https://2hsfyi4t5fiqdcanybdez4e4admrjeqghts22viz7uuo3d5k2nna.arweave.net/0eRcI5PpUQGIDcBGTPCcANkUkgY85a1VGf0o7Y-q01o/#/en/Universal-Data-License-How-to-use-it#toc_License_Fee"
  },
  {
    "term": "UDL",
    "headline": "An onchain content license format",
    "definition": "The UDL (short for Universal Data License) lets creators define how their permaweb files can be used or shared, right onchain.",
    "link": "https://2hsfyi4t5fiqdcanybdez4e4admrjeqghts22viz7uuo3d5k2nna.arweave.net/0eRcI5PpUQGIDcBGTPCcANkUkgY85a1VGf0o7Y-q01o/#/en/Universal-Data-License-How-to-use-it#toc_License_Fee"
  },
  {
    "term": "Kryder+ Rate",
    "headline": "The rate used to estimate long-term storage costs on Arweave",
    "definition": "The Kryder+ Rate is a modified calculation of how storage costs decline over time, factoring in replication, electricity, and hardware costs. It's used to predict how long Arweave's endowment fund can sustain storage, currently ensuring ~200 years of minimum storage.",
    "link": "https://x.com/onlyarweave/status/1790381688041947527"
  }
]
