[
  {
    "term": "Process",
    "headline": "A process is a smart contract deployed on AO",
    "definition": "Processes hold state, receive messages, and have functions to handle different interactions."
  },
  {
    "term": "Permaweb",
    "headline": "The Permaweb is a decentralized and immutable web built on top of Arweave",
    "definition": "The Permaweb refers to web applications and dApps built on AO and Arweave, accessible just like the normal web - but immutable and long-lasting.",
    "link": "https://arweave.net/0eRcI5PpUQGIDcBGTPCcANkUkgY85a1VGf0o7Y-q01o/#/en/the-permaweb"
  },
  {
    "term": "Message",
    "headline": "Messages are how processes on AO communicate",
    "definition": "Every interaction with a process on AO is sent as a message - each one verifiable, and stored as a transaction on Arweave."
  },
  {
    "term": "Handlers",
    "headline": "AO uses handlers to respond to different types of interactions (messages)",
    "definition": "Processes on AO contain handlers, which are functions written to \"handle\" different types of interactions."
  },
  {
    "term": "Arweave Wallet",
    "headline": "AO processes are deployed using an Arweave wallet",
    "definition": "An Arweave wallet is a crypto wallet which stores and holds $AR tokens. A wallet can be used to deploy AO processes, and upload data to Arweave."
  },
  {
    "term": "AOS",
    "headline": "AOS is a system used to interact with AO",
    "definition": "Developers can use AOS to deploy, execute, and interact with processes on AO. It includes common Lua modules to get started building processes.",
    "link": "https://cookbook_ao.arweave.net/guides/aos/intro.html"
  },
  {
    "term": "Arweave",
    "headline": "Arweave is the storage layer powering AO",
    "definition": "Every single AO process and message is stored and read from Arweave. It acts as the state layer for each process, while AO nodes read from it and perform computation.",
    "link": "https://www.arweave.org/"
  },
  {
    "term": "ArDrive",
    "headline": "Permanent cloud storage platform",
    "definition": "ArDrive is like your favourite cloud storage app, but pay once, store permanently. Users can upload files, pages, and more.",
    "link": "https://ardrive.io/"
  },
  {
    "term": "AOLink",
    "headline": "Explorer for AO processes",
    "definition": "AOLink is popular explorer for viewing AO processes, messages, and statistics.",
    "link": "https://ao.link"
  },
  {
    "term": "AOX",
    "headline": "AOX is a cross-chain bridge for AO and Arweave",
    "definition": "Users can bring wrapped assets in and out of the AO ecosystem, and can bridge assets from both Arweave and Ethereum.",
    "link": "https://aox.xyz"
  },
  {
    "term": "Apus Network",
    "headline": "GPU network providing computing power to AO",
    "definition": "Apus Network is a GPU network providing GPU computing power to AO, largely focused on decentralized AI applications.",
    "link": "https://apus.network"
  },
  {
    "term": "Astro",
    "headline": "AstroUSD ($USDA) is AO's first native stablecoin",
    "definition": "Astro aims to solve liquidity fragementation by acting a a universal conversion layer for different kinds of stablecoins bridged to AO.",
    "link": "https://astrousd.com"
  },
  {
    "term": "Basejump",
    "headline": "A platform for users to create their own games",
    "definition": "Basejump is a platform for users to create and play their own games with transferable assets. Basejump's ACTION substrate is built on top of AO, and data/metadata is settled on Arweave.",
    "link": "https://basejump.xyz"
  },
  {
    "term": "Bazar",
    "headline": "Atomic Asset (NFT) marketplace built on AO",
    "definition": "Bazar is an Atomic Asset (NFT) marketplace and launchpad built on AO, with assets and their associated metadata stored on Arweave.",
    "link": "https://bazar.arweave.net"
  },
  {
    "term": "Beacon Wallet",
    "headline": "Beacon is a native iOS mobile wallet for AO and Arweave",
    "definition": "Beacon is a non-custodial Arweave and AO native wallet that includes features such as 2FA, multi-sigs, built-in app integrations, and social recovery.",
    "link": "https://beaconwallet.app"
  },
  {
    "term": "BetterIDEa",
    "headline": "A web-based IDE for developing applications on AO",
    "definition": "BetterIDEa is a web-based IDE for developing applications on AO. It has built-in support for the AO Package Manager (APM) and other features for developing processes on AO.",
    "link": "https://betteridea.dev"
  },
  {
    "term": "Botega",
    "headline": "Botega is a decentralized exchange (DEX) and DeFi platform built on AO",
    "definition": "It is fully decentralized with the frontend stored on Arweave and backend processes on AO, and is focused on supporting sophisticated strategies and autonomous trading agents.",
    "link": "https://botega.arweave.net"
  },
  {
    "term": "Dexi",
    "headline": "Dexi is financial data platform for AO",
    "definition": "Dexi aggregates data from liquidity pools agents deployed on AO, and siplays data on trading volume, asset prices, fluctuations, and more.",
    "link": "https://dexi.arweave.net"
  },
  {
    "term": "LiquidOps",
    "headline": "LiquidOps is a lending and borrowing platform built on AO",
    "definition": "Users can accrue interest by providing liquidty, and lenders can take overcollateralized loans from the protocol.",
    "link": "https://liquidops.io"
  },
  {
    "term": "Load Network",
    "headline": "Load is an \"onchain data center\" focused on scaling EVM storage",
    "definition": "Load Network is focused on scaling EVM storage via Arweave, and building out other developer solutions and infrastructure for uploading data to the Permaweb.",
    "link": "https://www.load.network/"
  },
  {
    "term": "Lua",
    "headline": "Lua is the programming language used for AO processes",
    "definition": "Lua is a dynamically-typed, lightweight programming language used to write processes on AO.",
    "link": "https://learnxinyminutes.com/lua/"
  },
  {
    "term": "Permaswap",
    "headline": "Permaswap is a decentralized exchange (DEX) in the AO ecosystem",
    "definition": "Users can swap between assets such as AO, wrapped AR, and more, and can place limit orders and set up a custom slippage amount.",
    "link": "https://permaswap.network"
  },
  {
    "term": "PerplexFi",
    "headline": "A perpetual trading platform built on AO",
    "definition": "Perplex is a perpetual futures trading platform built fully onchain, on AO. Users can trade perpetual contracts with leverage, provide liquidty and earn yield from pools, and more.",
    "link": "https://perplex.finance"
  },
  {
    "term": "ProtocolLand",
    "headline": "Onchain hosting platform for code repositories",
    "definition": "ProtocolLand is like GitHub, but built on Arweave and AO. Users can store their code repositories and deploy websites and apps through built-in integrations.",
    "link": "https://protocol.land"
  },
  {
    "term": "RandAO",
    "headline": "Verifiable Random Function (VRF) protocol on AO",
    "definition": "RandAO is a Verifiable Random Function (VRF) protocol providing decentralized, provable randomness to the AO ecosystem.",
    "link": "https://www.randao.net/"
  },
  {
    "term": "StarGrid Battle Tactics",
    "headline": "A popular turn-based tactics game",
    "definition": "StarGrid is a turn-based tactics game built fully onchain, on AO. StarGrid is free to play, and supports logins through Wander and Metamask.",
    "link": "https://stargrid.arweave.net"
  },
  {
    "term": "Vento",
    "headline": "DEX aggregator for AO",
    "definition": "Vento is a DEX aggregator for AO. Vento was created by Vela Ventures, and aims to provide users with efficient routing for swaps on AO.",
    "link": "https://ventoswap.com"
  },
  {
    "term": "ViewBlock",
    "headline": "A popular block explorer for Arweave",
    "definition": "Viewblock is one of the most popular block explorers for Arweave, and provides information on transactions, nodes, Arweave's storage endowment, and more.",
    "link": "https://viewblock.io"
  },
  {
    "term": "Wander Wallet",
    "headline": "Browser extension and mobile wallet for Arweave and AO",
    "definition": "Wander (formerly ArConnect) is a non-custodial Arweave and AO native wallet with extensive features. It's available as a browser extension and mobile app.",
    "link": "https://wander.app/"
  },
  {
    "term": "Autonomous Finance",
    "headline": "A DeFi organization focused on agentic finance on AO",
    "definition": "Autonomous Finance is an organization building out DeFi products and infrastructure on AO. Their products include Botega and Dexi.",
    "link": "https://autonomous.finance"
  },
  {
    "term": "Arweave Explorer",
    "headline": "An ArNS data explorer",
    "definition": "explorer.arweave.net is not an Arweave block explorer, but rather an ArNS-powered data explorer for Arweave, built on AR.IO and Wayfinder.",
    "link": "https://explorer.arweave.net"
  },
  {
    "term": "Permaweb Index",
    "headline": "The Permaweb Index ($PI) is a unifying token for the Permaweb",
    "definition": "The Permaweb Index ($PI) is a token which represents 1/3 Arweave (AR), 1/3 AO, and 1/3 projects building on the Permaweb. \nIt acts as a single token to gain exposure to the entire Permaweb ecosystem, and users can allocate their yield to specified Permaweb projects. \nNot financial advice.",
    "link": "https://ao.arweave.net/#/delegate"
  },
  {
    "term": "ArFleet",
    "headline": "ArFleet is a temporary storage platform on AO",
    "definition": "ArFleet is a temporary or time-based storage platform built on AO. ArFleet is currently in testnet, and can be accessed with an ArFleet Genesis Pass.",
    "link": "https://arfleet.arweave.net"
  },
  {
    "term": "Permanent Storage",
    "headline": "Arweave provides decentralized, tamper-proof data storage where files are stored permanently onchain.",
    "definition": "This is made possible through an endowment model, where a single upfront fee covers storage costs for at least 200 years, with no need for renewals or ongoing payments."
  },
  {
    "term": "Blockweave",
    "headline": "The Blockweave is Arweave’s unique way of storing data, operating more like a web than a chain.",
    "definition": "It checks random pieces instead of everything in order, saving energy and letting it store huge amounts of info safely and efficiently."
  },
  {
    "term": "ArNS",
    "headline": "ArNS is shorthand for the Arweave Name Service.",
    "definition": "ArNS domains connect friendly names to permanent applications, pages, data, or identities.",
    "link": "https://ar.io/arns"
  },
  {
    "term": "Actor Oriented",
    "headline": "AO processes follow the actor model of computation.",
    "definition": "Actor oriented means each process works independently with its own data and talks to other processes by sending messages. This setup makes building reliable and flexible decentralized apps easier."
  },
  {
    "term": "Arweave Name System",
    "headline": "The Arweave Name System (ArNS) connects friendly names to permanent applications, pages, data, or identities.",
    "definition": "Unlike traditional domains, ArNS names never expire and don’t rely on a central authority.",
    "link": "https://ar.io/arns"
  },
  {
    "term": "Bridge",
    "headline": "A bridge is a system that enables the transfer of assets from one blockchain ecosystem to another.",
    "definition": "In the case of AO Computer, users may wish to bridge Arweave's native coin $AR to AO, or perform other cross-chain transfers with assets such as stETH, DAI, or USDS from Ethereum."
  },
  {
    "term": "Bundler",
    "headline": "A service for aggregating data uploads",
    "definition": "A bundler batches multiple uploads into a single Arweave transaction to improve efficiency. Bundling relies upon the ANS-104 standard."
  },
  {
    "term": "Arweave Network Standard",
    "headline": "Agreed-upon rules for building on Arweave",
    "definition": "Arweave Network Standards (ANS) define common formats, protocols, and conventions for storing and interacting with data on Arweave. Each standard is numbered, like ANS-###, and helps ensure compatibility across apps and tools.",
    "link": "https://github.com/ArweaveTeam/arweave-standards/tree/master/ans"
  },
  {
    "term": "ANS-104",
    "headline": "Standard for bundling multiple data items into one transaction",
    "definition": "ANS-104 defines how to combine multiple independently signed data items into a single Arweave transaction—making uploads more efficient and scalable.",
    "link": "https://github.com/ArweaveTeam/arweave-standards/blob/master/ans/ANS-104.md"
  },
  {
    "term": "Arweave Name Token",
    "headline": "A token that controls an ArNS name on AO",
    "definition": "Each Arweave Name Token (ANT) is linked to a registered ArNS name and lets the owner manage subdomains, update associated Arweave transaction IDs, transfer ownership, and perform other name-related functions.",
    "link": "https://arns.ar.io/"
  },
  {
    "term": "ANT",
    "headline": "A token that controls an ArNS name on AO",
    "definition": "Each ANT (short for Arweave Name Token) is linked to a registered ArNS name and lets the owner manage subdomains, update associated Arweave transaction IDs, transfer ownership, and perform other name-related functions.",
    "link": "https://arns.ar.io/"
  },
  {
    "term": "Weave",
    "headline": "The collective data stored on the Arweave network",
    "definition": "Weave refers to all the data permanently stored across Arweave's decentralized network, forming a single, immutable archive.",
    "link": "https://viewblock.io/arweave/stat/cumulativeWeaveSize"
  },
  {
    "term": "Gateway",
    "headline": "Gateways connect users to the Arweave network",
    "definition": "Gateways facilitate data hosting, domain management, and seamless querying on Arweave. Running a gateway helps secure the network and can earn rewards. Not financial advice.",
    "link": "https://ar.io/gateways"
  },
  {
    "term": "Universal Data License (UDL)",
    "headline": "An onchain content license format",
    "definition": "The Universal Data License (UDL) lets creators define how their permaweb files can be used or shared, right onchain.",
    "link": "https://2hsfyi4t5fiqdcanybdez4e4admrjeqghts22viz7uuo3d5k2nna.arweave.net/0eRcI5PpUQGIDcBGTPCcANkUkgY85a1VGf0o7Y-q01o/#/en/Universal-Data-License-How-to-use-it#toc_License_Fee"
  },
  {
    "term": "UDL",
    "headline": "An onchain content license format",
    "definition": "The UDL (short for Universal Data License) lets creators define how their permaweb files can be used or shared, right onchain.",
    "link": "https://2hsfyi4t5fiqdcanybdez4e4admrjeqghts22viz7uuo3d5k2nna.arweave.net/0eRcI5PpUQGIDcBGTPCcANkUkgY85a1VGf0o7Y-q01o/#/en/Universal-Data-License-How-to-use-it#toc_License_Fee"
  },
  {
    "term": "Kryder+ Rate",
    "headline": "The rate used to estimate long-term storage costs on Arweave",
    "definition": "The Kryder+ Rate is a modified calculation of how storage costs decline over time, factoring in replication, electricity, and hardware costs. It's used to predict how long Arweave's endowment fund can sustain storage, currently ensuring ~200 years of minimum storage.",
    "link": "https://x.com/onlyarweave/status/1790381688041947527"
  },
  {
    "term": "Phil Mataras",
    "headline": "Founder of AR.IO and ArDrive, building permanent cloud infrastructure on Arweave",
    "definition": "Phil leads the development of AR.IO’s decentralized gateways, naming system, and bundled storage services, making permanent Arweave storage more accessible and scalable.",
    "link": "https://x.com/onlyarweave/status/1864323804199309366"
  },
  {
    "term": "CryptoChèrie",
    "headline": "Arweave educator and community builder empowering women on the Permaweb",
    "definition": "CryptoChèrie created the popular DumDumz NFT collection, founded Women of Arweave and AO to amplify women in the ecosystem, and produces educational content to grow Arweave adoption.",
    "link": "https://x.com/onlyarweave/status/1869469562330403055"
  },
  {
    "term": "Tate Berenbaum",
    "headline": "Founder & CEO of Community Labs, advancing the Arweave ecosystem",
    "definition": "Tate Berenbaum leads Community Labs, a venture studio focused on building decentralized applications and infrastructure on Arweave, supporting key projects and developer tools across the ecosystem.",
    "link": "https://x.com/onlyarweave/status/1856713668085547192"
  },
  {
    "term": "Marton Lederer",
    "headline": "Founder of Wander (formerly ArConnect) and co-founder of LiquidOps",
    "definition": "Marton Lederer built Wander, the first non-custodial Arweave wallet, and co-founded LiquidOps, a decentralized lending platform on Arweave.",
    "link": "https://x.com/onlyarweave/status/1877026420259709142"
  },
  {
    "term": "Lorimer Jenkins",
    "headline": "Co-founder and CEO of LiquidOps, pioneering DeFi on Arweave and AO",
    "definition": "Lorimer Jenkins leads LiquidOps, Arweave's first decentralized lending and borrowing protocol, enabling users to earn passive income by lending tokens on AO.",
    "link": "https://x.com/onlyarweave/status/1879579361629831329"
  },
  {
    "term": "Jonny Ringo",
    "headline": "AO Community Manager, supporting developers and users",
    "definition": "Jonny Ringo manages the AO community, fostering engagement, supporting developers, and helping users navigate the Arweave and AO ecosystem.",
    "link": "https://x.com/onlyarweave/status/1887875837145251910"
  },
  {
    "term": "MC Lars",
    "headline": "Community and Events Strategist at Permanent Data Solutions",
    "definition": "MC Lars organizes and leads community initiatives and events for Permanent Data Solutions, helping to grow engagement and support within the Arweave ecosystem.",
    "link": "https://x.com/onlyarweave/status/1892250577645760706"
  },
  {
    "term": "Nick Juliano",
    "headline": "Co-founder of Bazar, building decentralized marketplaces on Arweave",
    "definition": "Nick Juliano co-founded Bazar, a marketplace for atomic assets on Arweave, creating tools that empower creators to list, trade, and manage digital assets efficiently.",
    "link": "https://x.com/onlyarweave/status/1902353368636649909"
  },
  {
    "term": "Ankush Singh",
    "headline": "Founder of BetterIDEa and Arweave India Community Manager",
    "definition": "Ankush Singh leads BetterIDEa, helps manage the Arweave India community, and serves as Entrepreneur in Residence at Forward Research, supporting developers and ecosystem growth.",
    "link": "https://x.com/onlyarweave/status/1910237578252660905"
  },
  {
    "term": "David Kong",
    "headline": "Creator of StarGrid Battle Tactics",
    "definition": "David Kong is the creator of StarGrid Battle Tactics, a fully onchain tactical game built on AO. Drawing from his experience as a competitive Street Fighter player, David designed a game that emphasizes strategic depth and player skill.",
    "link": "https://x.com/onlyarweave/status/1920116449382896010"
  },
  {
    "term": "El Tío",
    "headline": "Community Manager and Bazar Lead",
    "definition": "El Tío helps manage several Permaweb communities while leading Bazar Marketplace, supporting creators and fostering engagement across the ecosystem.",
    "link": "https://x.com/onlyarweave/status/1927364222410784815"
  },
  {
    "term": "Tom Wilson",
    "headline": "CTO at Forward Research, leading developer tools and services on Arweave and AO Computer",
    "definition": "Tom Wilson is a highly experienced CTO at Forward Research, building developer tools and services that strengthen and expand the Arweave and AO ecosystem.",
    "link": "https://x.com/onlyarweave/status/1940047773140988286"
  },
  {
    "term": "Holographic State",
    "headline": "A state model in AO where process state is implied by its message log",
    "definition": "In AO, each process maintains its state independently through a log of messages stored on Arweave. This 'holographic' state is not stored directly but inferred from the log, enabling parallel processing, faster interactions, and scalable, verifiable computation.",
    "link": "https://x.com/aoComputerClub/status/1930640187123814476"
  },
  {
    "term": "Community Labs",
    "headline": "A software company and venture studio accelerating Arweave and AO adoption",
    "definition": "Community Labs builds foundational tools and infrastructure for the Arweave and AO ecosystem. As a venture studio, it supports founders and teams in developing and scaling products from idea to mass adoption. The company is led by founder and CEO Tate Berenbaum.",
    "link": "https://www.communitylabs.com/"
  },
  {
    "term": "Forward Research",
    "headline": "A research and development incubator for Arweave and AO",
    "definition": "Forward Research is building the foundations of the permaweb, supporting builders and founders who create new classes of web services on Arweave that provably respect user rights. Forward Research provides resources and an environment designed to help projects grow from zero to market fit.",
    "link": "https://x.com/fwdresearch"
  },
  {
    "term": "$APUS",
    "headline": "$APUS is the fair launch token supporting the Apus Network permaweb project.",
    "definition": "The AO process ID for $APUS is jHZBsy0SalZ6I5BmYKRUt0AtLsn-FCFhqf_n6AgwGlc.",
    "link": "https://www.apus.network/"
  },
  {
    "term": "$BOTG",
    "headline": "$BOTG is the fair launch token supporting the Botega permaweb project.",
    "definition": "The AO process ID for $BOTG is UcBPqkaVI7W4I_YMznrt2JUoyc_7TScCdZWOOSBvMSU.",
    "link": "https://botega.defi.ao/"
  },
  {
    "term": "$ACTION",
    "headline": "$ACTION is the fair launch token supporting the Basejump permaweb project.",
    "definition": "The AO process ID for $ACTION is NXZjrPKh-fQx8BUCG_OXBUtB4Ix8Xf0gbUtREFoWQ2Q.",
    "link": "https://basejump.xyz/home"
  },
  {
    "term": "$LOAD",
    "headline": "$LOAD is the fair launch token supporting the Load Network permaweb project.",
    "definition": "The AO process ID for $LOAD is Qz3n2P-EiWNoWsvk7gKLtrV9ChvSXQ5HJPgPklWEgQ0.",
    "link": "https://www.load.network/"
  },
  {
    "term": "$WNDR",
    "headline": "$WNDR is the fair launch token supporting the Wander permaweb project.",
    "definition": "The AO process ID for $WNDR is 11T2aA8M-ZcoEnDqG37Kf2dzEGY2r4_CyYeiN_1VTvU.",
    "link": "https://www.wander.app/"
  },
  {
    "term": "$PL",
    "headline": "$PL is the fair launch token supporting the Protocol.Land permaweb project.",
    "definition": "The AO process ID for $PL is Wc8Rg-owsWSvrmb5XAlmSs3_4UtHo9i5ui2o9UCFuTk.",
    "link": "https://protocol.land/"
  },
  {
    "term": "$SMONEY",
    "headline": "$SMONEY is the fair launch token supporting the StarGrid Battle Tactics permaweb project.",
    "definition": "The AO process ID for $SMONEY is oIuISObCStjTFMnV3CrrERRb9KTDGN4507-ARysYzLE.",
    "link": "https://stargrid.ar.io/"
  },
  {
    "term": "$ARIO",
    "headline": "$ARIO is the fair launch token supporting the AR.IO permaweb project.",
    "definition": "The AO process ID for $ARIO is rW7h9J9jE2Xp36y4SKn2HgZaOuzRmbMfBRPwrFFifHE.",
    "link": "https://ar.io/"
  },
  {
    "term": "$GAME",
    "headline": "$GAME is the fair launch token supporting the ArcAO permaweb project.",
    "definition": "The AO process ID for $GAME is nYHhoSEtelyL3nQ6_CFoOVnZfnz2VHK-nEez962YMm8.",
    "link": "https://game.arweave.net/"
  },
  {
    "term": "$LQD",
    "headline": "$LQD is the fair launch token supporting the LiquidOps permaweb project.",
    "definition": "The AO process ID for $LQD is N0L1lUC-35wgyXK31psEHRjySjQMWPs_vHtTas5BJa8.",
    "link": "https://liquidops.io/"
  },
  {
    "term": "$PIXL",
    "headline": "$PIXL is the fair launch token supporting the Bazar permaweb project.",
    "definition": "The AO process ID for $PIXL is 3eZ6_ry6FD9CB58ImCQs6Qx_rJdDUGhz-D2W1AqzHD8.",
    "link": "https://bazar.arweave.net/"
  },
  {
    "term": "$NAB",
    "headline": "$NAB is the fair launch token supporting the Number Always Bigger permaweb project.",
    "definition": "The AO process ID for $NAB is X0HxJGSBzney-YLDzAtjt9Pc-c6N_1sf_MlqO0ezoeI.",
    "link": "https://number-always-bigger.ar.io/"
  },
  {
    "term": "device",
    "headline": "A component in AO that defines how messages should be interpreted",
    "definition": "Each AO message can specify a Device that Converge-compatible systems use to interpret its contents. If no Device is given, it defaults to 'Message.' Every Device must implement the functions 'ID' and 'Keys'.",
    "link": "https://hyperbeam.ar.io/build/devices/hyperbeam-devices.html"
  },
  {
    "term": "asynchronous message passing",
    "headline": "A communication paradigm where messages are sent without waiting for the receiver",
    "definition": "In asynchronous message passing, senders transmit messages without waiting for receivers to be ready, enabling non-blocking operations and improved scalability in distributed systems."
  },
  {
    "term": "hashpath",
    "headline": "A cryptographic fingerprint of a program’s state-space and operations",
    "definition": "Hashpaths are Merklized sequences of inputs and operations that reference specific points in a program’s state. They ensure integrity and traceability while enabling developers to compose complex, verifiable data pipelines and interact with processes in a flexible, trustless way."
  },
  {
    "term": "Atomic Asset",
    "headline": "NFTs on Arweave that bundle data, metadata, and ownership in one immutable transaction",
    "definition": "Atomic Assets are non-fungible tokens built on Arweave where the asset, its metadata, and ownership logic are stored together permanently onchain. This atomic structure ensures immutability and verifiability, making them ideal for marketplaces like Bazar.",
    "link": "https://bazar.ar.io/#/docs/developers/atomic-assets"
  },
  {
    "term": "transaction",
    "headline": "The fundamental building block of the Arweave network",
    "definition": "All data on Arweave is stored as transactions. Each transaction contains data and metadata (tags) that can be queried and retrieved. Transactions can be posted directly or via bundling services, and may include tags for discovery or bundles for scalability—forming the foundation of all activity on the permaweb.",
    "link": "https://cookbook.arweave.net/fundamentals/transactions/transaction-types.html"
  },
  {
    "term": "VDF",
    "headline": "Short for Verifiable Delay Function, a cryptographic function that proves a minimum time has passed",
    "definition": "A VDF requires a set number of sequential steps to compute, producing a unique output that can be quickly and publicly verified. Arweave implements a chained hashing VDF using SHA2-256, ensuring that generating a valid checkpoint implies the passage of real time. This mechanism provides a simple, trustless way to prove time intervals in the network.",
    "link": "https://nm5d5uvmhjw363xf3idhjrd6nllqqrk76kkjbfpavyfmf7zzddxa.arweave.net/azo-0qw6bb9u5doGdMR-atcIRV_ylJCV4K4Kwv85GO4"
  },
  {
    "term": "verifiable delay function",
    "headline": "A cryptographic function that proves a minimum time has passed",
    "definition": "A Verifiable Delay Function (VDF) requires a set number of sequential steps to compute, producing a unique output that can be quickly and publicly verified. Arweave implements a chained hashing VDF using SHA2-256, ensuring that generating a valid checkpoint implies the passage of real time. This mechanism provides a simple, trustless way to prove time intervals in the network.",
    "link": "https://nm5d5uvmhjw363xf3idhjrd6nllqqrk76kkjbfpavyfmf7zzddxa.arweave.net/azo-0qw6bb9u5doGdMR-atcIRV_ylJCV4K4Kwv85GO4"
  },
  {
    "term": "Permanent Data Solutions",
    "headline": "A company building apps and infrastructure for the permaweb",
    "definition": "Permanent Data Solutions (PDS) develops web3 applications and core infrastructure that power the permaweb, a permanent decentralized internet. Its innovations include ArDrive, ar.io, ArNS, and the Wayfinder protocol. The company is led by Phil Mataras.",
    "link": "https://pds.inc/"
  },
  {
    "term": "Longview Labs",
    "headline": "An organization creating content, products, and experiences for the Arweave and AO community",
    "definition": "Longview Labs produces educational content, digital products, and community initiatives fully dedicated to Arweave and the permaweb. Its innovations include Arweave Hub, the Permaweb Pioneers podcast, Arweave India, aoDevBot, MyXSite, and the Only Arweave and ao Computer Club social accounts. Longview Labs is led by founder Greg Albritton.",
    "link": "https://www.longviewlabs.co/"
  },
  {
    "term": "Armstrong",
    "headline": "The smallest unit of the AO Token",
    "definition": "One AO token is equal to one trillion (1,000,000,000,000) Armstrongs. The unit is named after Joe Armstrong, one of the inventors of Erlang. Transactions on AO typically specify amounts in Armstrongs rather than whole AO tokens.",
    "link": "https://www.communitylabs.com/blog/quick-guide-to-ao-token"
  },
  {
    "term": "Erlang",
    "headline": "Programming language behind HyperBEAM",
    "definition": "Erlang is used to implement the HyperBEAM core, providing robustness and support for building distributed, fault-tolerant applications with reliable message passing and process management."
  },
  {
    "term": "Messenger Unit",
    "headline": "Node in the AO network that relays messages",
    "definition": "A Messenger Unit (MU) is a node in the AO network that relays messages throughout the system. It serves as the entry point for users to interact with processes on AO.",
    "link": "https://video.twimg.com/amplify_video/1920821058233356288/vid/avc1/1920x1080/rQ2PU3zeqIT4XWhw.mp4"
  },
  {
    "term": "MU",
    "headline": "Messenger Unit: Node in the AO network that relays messages",
    "definition": "A Messenger Unit (MU) is a node in the AO network that relays messages throughout the system. It serves as the entry point for users to interact with processes on AO.",
    "link": "https://video.twimg.com/amplify_video/1920821058233356288/vid/avc1/1920x1080/rQ2PU3zeqIT4XWhw.mp4"
  },
  {
    "term": "Scheduler Unit",
    "headline": "Node in the AO network responsible for message ordering",
    "definition": "A Scheduler Unit (SU) assigns atomically incrementing slot numbers to messages sent to a process, ensuring deterministic ordering within the AO network.",
    "link": "https://video.twimg.com/amplify_video/1920821058233356288/vid/avc1/1920x1080/rQ2PU3zeqIT4XWhw.mp4"
  },
  {
    "term": "SU",
    "headline": "Scheduler Unit: Node responsible for message ordering",
    "definition": "An SU (Scheduler Unit) assigns atomically incrementing slot numbers to messages sent to a process, ensuring deterministic ordering within the AO network.",
    "link": "https://video.twimg.com/amplify_video/1920821058233356288/vid/avc1/1920x1080/rQ2PU3zeqIT4XWhw.mp4"
  },
  {
    "term": "Compute Unit",
    "headline": "Node in the AO network responsible for executing process code",
    "definition": "A Compute Unit (CU) executes process code and manages state in the AO network, competing with other CUs to resolve process state.",
    "link": "https://video.twimg.com/amplify_video/1920821058233356288/vid/avc1/1920x1080/rQ2PU3zeqIT4XWhw.mp4"
  },
  {
    "term": "CU",
    "headline": "Compute Unit: Node responsible for executing process code",
    "definition": "A CU (Compute Unit) executes process code and manages state in the AO network, competing with other CUs to resolve process state.",
    "link": "https://video.twimg.com/amplify_video/1920821058233356288/vid/avc1/1920x1080/rQ2PU3zeqIT4XWhw.mp4"
  },
  {
    "term": "Winston",
    "headline": "The smallest unit of the AR Token",
    "definition": "One AR token is equal to one trillion (1,000,000,000,000) Winstons. Winstons are used for precise calculations and transactions within the Arweave network, similar to satoshis in Bitcoin."
  },
  {
    "term": "Cron",
    "headline": "Time-based job scheduler in AO",
    "definition": "Cron allows AO processes to execute functions on a schedule, enabling autonomous and recurring contract execution."
  },
  {
    "term": "hyper parallel",
    "headline": "AO is a hyper parallel computer",
    "definition": "AO is described as a hyper parallel computer because it can execute many processes simultaneously and independently, enabling faster processing and efficient use of resources.",
    "link": "https://x.com/onlyarweave/status/1842218286236499972"
  },
  {
    "term": "hyper parallel computing",
    "headline": "Executing multiple processes simultaneously in AO",
    "definition": "Hyper Parallel Computing allows AO to run multiple processes independently at the same time, improving system performance and efficiently utilizing computational resources.",
    "link": "https://x.com/onlyarweave/status/1842218286236499972"
  },
  {
    "term": "Wayfinder Protocol",
    "headline": "Protocol for dynamic gateway routing and AR.IO integration",
    "definition": "The Wayfinder Protocol lets applications switch between network gateways, abstracts top-level domains from Arweave data, and powers the ar:// schema for seamless access to ArNS names, base layer transactions, and bundled data items.",
    "link": "https://ar.io/access"
  },
  {
    "term": "Storage Endowment",
    "headline": "Financial mechanism for long-term Arweave storage",
    "definition": "The Storage Endowment lets users pay upfront for long-term storage (≈200 years at current prices). Funds are held in the endowment and only released if needed to pay for ongoing storage costs, creating a natural token sink that reduces circulating supply.",
    "link": "https://viewblock.io/arweave/stat/cumulativeEndowmentSize"
  },
  {
    "term": "mempool",
    "headline": "Temporary storage of pending Arweave transactions",
    "definition": "A mempool (short for memory pool) is a component of Arweave mining nodes that temporarily holds valid transactions broadcast to the network but not yet added to a block."
  },
  {
    "term": "ArDrive Turbo",
    "headline": "Ultrahigh-throughput Permaweb storage service",
    "definition": "ArDrive Turbo streamlines uploading, indexing, and transmitting data to Arweave. It supports payments in fiat and crypto, uses efficient bundling for uploads, and offers Turbo Credits with the same storage power as AR tokens for precise control.",
    "link": "https://docs.ardrive.io/docs/turbo/what-is-turbo.html"
  },
  {
    "term": "under_names",
    "headline": "Subdomains for ArNS names",
    "definition": "ANT owners can configure multiple subdomains for their registered ArNS name, called under_names or undernames. They use an underscore \"_\" instead of a dot \".\" to separate the subdomain from the main ArNS domain and can be added at registration or later.",
    "link": "https://docs.ar.io/arns#under-names"
  },
  {
    "term": "Trusted Execution Environment",
    "headline": "Secure processor area protecting code and data",
    "definition": "A Trusted Execution Environment (TEE) is a secure area of a processor in AO that ensures code and data inside are protected for confidentiality and integrity, similar to a hardware wallet.",
    "link": "https://video.twimg.com/ext_tw_video/1909536236529741824/pu/vid/avc1/1280x720/XAqnj6GTfW3iHVR3.mp4?tag=12"
  },
  {
    "term": "TEE",
    "headline": "Trusted Execution Environment: Secure processor area",
    "definition": "A TEE (Trusted Execution Environment) is a protected area of a processor in AO that guarantees the confidentiality and integrity of code and data, offering security akin to a hardware wallet.",
    "link": "https://video.twimg.com/ext_tw_video/1909536236529741824/pu/vid/avc1/1280x720/XAqnj6GTfW3iHVR3.mp4?tag=12"
  },
  {
    "term": "Permanent Cloud Network",
    "headline": "AR.IO: Decentralized, censorship-resistant cloud infrastructure",
    "definition": "AR.IO is the first permanent cloud network, providing decentralized access to data, storage, and domains. Built on Arweave, it ensures information and applications remain tamper-proof, universally accessible, and free from centralized control, with incentivized gateways for reliability and permanent domains for true digital ownership.",
    "link": "https://ar.io/"
  },
  {
    "term": "Reality Protocol",
    "headline": "A framework for decentralized AI agents and interactive worlds on AO Computer",
    "definition": "Reality Protocol lets AI agents operate autonomously within open, onchain worlds, supporting scalable, verifiable computation and interactive experiences in games like LlamaLand, Aqualandia, and RuneRealm.",
    "link": "https://github.com/elliotsayes/Reality/blob/main/docs/Readme.md"
  },
  {
    "term": "AO-Core",
    "headline": "The protocol specification for AO Computer",
    "definition": "AO-Core defines how distributed, message-passing processes run on AO. Inspired by Erlang and the actor model, it ensures reliable execution and supports modular, composable applications.",
    "link": "https://cookbook_ao.arweave.net/welcome/ao-core-introduction.html"
  },
  {
    "term": "HyperBEAM",
    "headline": "The decentralized runtime implementing AO-Core on AO Computer",
    "definition": "HyperBEAM turns AO-Core’s concepts into a working environment, enabling trust-minimized computation with deterministic execution, message scheduling, and WebAssembly support. It powers AO as a scalable, distributed supercomputer on Arweave.",
    "link": "https://hyperbeam.ar.io/"
  }
]
